<a href="https://colab.research.google.com/github/nirmitktripathii/Football_Data_analysis_ISL/blob/main/Untitled1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import io
import pandas as pd
import math

import matplotlib.pyplot as plt
import seaborn as sns
import plotly.express as px

In [ ]:
d = {'col1': [1,2], 'col2': [3,4]}
df = pd.DataFrame(data=d)

In [ ]:
df

   col1  col2
0     1     3
1     2     4

In [ ]:
df.loc[0,'col1']

1

In [ ]:
df.loc[0,'col2']

3

In [ ]:
df.loc[1,'col1']

2

In [ ]:
df.loc[1,'col2']

4

In [ ]:
df["col3"] = [42,65]

In [ ]:
df

   col1  col2  col3
0     1     3    42
1     2     4    65

In [ ]:
df.loc[1, 'col3'] = 12

In [ ]:
df

   col1  col2  col3
0     1     3    42
1     2     4    12

In [ ]:
df[['col1','col3']]

   col1  col3
0     1    42
1     2    12

In [ ]:
df['col1']

0    1
1    2
Name: col1, dtype: int64

In [ ]:
df.loc[2] = [7,8,9]

In [ ]:
df.loc[3]  = ['a','b','c']

In [ ]:
df.loc[4] = ['d','e','f']

In [ ]:
df

  col1 col2 col3
0    1    3   42
1    2    4   12
2    7    8    9
3    a    b    c
4    d    e    f

In [ ]:
df.loc[[0,4,2],['col1','col2']]

  col1 col2
0    1    3
4    d    e
2    7    8